ChibiOS/ChibiOS/os/hal/ports/STM32/STM32C0xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2022 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.f
*/

/**
 * @file    STM32C0xx/hal_lld.h
 * @brief   STM32C0xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32C011xx, STM32C031xx.
 *          - STM32C051xx, STM32C071xx.
 *          - STM32C091xx, STM32C092xx.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2               TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32C011xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME                       "STM32C0 Entry-level Mainstream MCU"

#elif defined(STM32C031xx)
#define PLATFORM_NAME                       "STM32C0 Entry-level Mainstream MCU"

#elif defined(STM32C051xx)
#define PLATFORM_NAME                       "STM32C0 Entry-level Mainstream MCU"

#elif defined(STM32C071xx)
#define PLATFORM_NAME                       "STM32C0 Entry-level Mainstream MCU with USB"

#elif defined(STM32C091xx)
#define PLATFORM_NAME                       "STM32C0 Entry-level Mainstream MCU with FDCAN"

#elif defined(STM32C092xx)
#define PLATFORM_NAME                       "STM32C0 Entry-level Mainstream MCU with FDCAN"

#else
#error "STM32C0 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32C0XX) || defined(__DOXYGEN__)
#define STM32C0XX
#endif
/** @} */

/**
 * @name   Clock points names
 * @{
 */
#define CLK_SYSCLK                          0U
#define CLK_HSE                             1U
#define CLK_HSISYS                          2U
#define CLK_HSIKER                          3U
#define CLK_HSIUSB48                        4U
#define CLK_HCLK                            5U
#define CLK_PCLK                            6U
#define CLK_PCLKTIM                         7U
#define CLK_MCO1                            8U
#define CLK_MCO2                            9U
#define CLK_ARRAY_SIZE                      10U
#define CLK_POINT_NAMES                                                     \
  {                                                                         \
    "SYSCLK", "HSE", "HSISYS", "HSIKER", "HSIUSB48", "HCLK", "PCLK",        \
    "PCLKTIM", "MCO1", "MCO2"                                               \
  }
/** @} */

/**
 * @name    PWR_CR2 register helpers
 * @{
 */
#define PWR_CR2_PVM_VDDIO2_FIELD(n)         ((n) << PWR_CR2_PVM_VDDIO2_Pos)
#define PWR_CR2_PVM_VDDIO2_DISABLED         PWR_CR2_PVM_VDDIO2_FIELD(0U)
#define PWR_CR2_PVM_VDDIO2_ENABLED          PWR_CR2_PVM_VDDIO2_FIELD(1U)
#define PWR_CR2_PVM_VDDIO2_BYPASSED         PWR_CR2_PVM_VDDIO2_FIELD(2U)
/** @} */

/**
 * @name    RCC_CR register helpers
 * @{
 */
#define RCC_CR_HSIDIV_FIELD(n)              ((n) << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_DIV1                  RCC_CR_HSIDIV_FIELD(0U)
#define RCC_CR_HSIDIV_DIV2                  RCC_CR_HSIDIV_FIELD(1U)
#define RCC_CR_HSIDIV_DIV4                  RCC_CR_HSIDIV_FIELD(2U)
#define RCC_CR_HSIDIV_DIV8                  RCC_CR_HSIDIV_FIELD(3U)
#define RCC_CR_HSIDIV_DIV16                 RCC_CR_HSIDIV_FIELD(4U)
#define RCC_CR_HSIDIV_DIV32                 RCC_CR_HSIDIV_FIELD(5U)
#define RCC_CR_HSIDIV_DIV64                 RCC_CR_HSIDIV_FIELD(6U)
#define RCC_CR_HSIDIV_DIV128                RCC_CR_HSIDIV_FIELD(7U)

#define RCC_CR_HSIKERDIV_FIELD(n)           ((n) << RCC_CR_HSIKERDIV_Pos)
#define RCC_CR_HSIKERDIV_DIV1               RCC_CR_HSIKERDIV_FIELD(0U)
#define RCC_CR_HSIKERDIV_DIV2               RCC_CR_HSIKERDIV_FIELD(1U)
#define RCC_CR_HSIKERDIV_DIV3               RCC_CR_HSIKERDIV_FIELD(2U)
#define RCC_CR_HSIKERDIV_DIV4               RCC_CR_HSIKERDIV_FIELD(3U)
#define RCC_CR_HSIKERDIV_DIV5               RCC_CR_HSIKERDIV_FIELD(4U)
#define RCC_CR_HSIKERDIV_DIV6               RCC_CR_HSIKERDIV_FIELD(5U)
#define RCC_CR_HSIKERDIV_DIV7               RCC_CR_HSIKERDIV_FIELD(6U)
#define RCC_CR_HSIKERDIV_DIV8               RCC_CR_HSIKERDIV_FIELD(7U)

#if STM32_RCC_HAS_SYSDIV || defined(__DOXYGEN__)
#define RCC_CR_SYSDIV_FIELD(n)              ((n) << RCC_CR_SYSDIV_Pos)
#define RCC_CR_SYSDIV_DIV1                  RCC_CR_SYSDIV_FIELD(0U)
#define RCC_CR_SYSDIV_DIV2                  RCC_CR_SYSDIV_FIELD(1U)
#define RCC_CR_SYSDIV_DIV3                  RCC_CR_SYSDIV_FIELD(2U)
#define RCC_CR_SYSDIV_DIV4                  RCC_CR_SYSDIV_FIELD(3U)
#define RCC_CR_SYSDIV_DIV5                  RCC_CR_SYSDIV_FIELD(4U)
#define RCC_CR_SYSDIV_DIV6                  RCC_CR_SYSDIV_FIELD(5U)
#define RCC_CR_SYSDIV_DIV7                  RCC_CR_SYSDIV_FIELD(6U)
#define RCC_CR_SYSDIV_DIV8                  RCC_CR_SYSDIV_FIELD(7U)
#endif
/** @} */

/**
 * @name    RCC_CFGR register helpers
 * @{
 */
#define RCC_CFGR_SW_FIELD(n)                ((n) << RCC_CFGR_SW_Pos)
#define RCC_CFGR_SW_HSISYS                  RCC_CFGR_SW_FIELD(0U)
#define RCC_CFGR_SW_HSE                     RCC_CFGR_SW_FIELD(1U)
#define RCC_CFGR_SW_HSIUSB48                RCC_CFGR_SW_FIELD(2U)
#define RCC_CFGR_SW_LSI                     RCC_CFGR_SW_FIELD(3U)
#define RCC_CFGR_SW_LSE                     RCC_CFGR_SW_FIELD(4U)

#define RCC_CFGR_MCO2SEL_FIELD(n)           ((n) << RCC_CFGR_MCO2SEL_Pos)
#define RCC_CFGR_MCO2SEL_NOCLOCK            RCC_CFGR_MCO2SEL_FIELD(0U)
#define RCC_CFGR_MCO2SEL_SYSCLK             RCC_CFGR_MCO2SEL_FIELD(1U)
#define RCC_CFGR_MCO2SEL_HSI48              RCC_CFGR_MCO2SEL_FIELD(3U)
#define RCC_CFGR_MCO2SEL_HSE                RCC_CFGR_MCO2SEL_FIELD(4U)
#define RCC_CFGR_MCO2SEL_LSI                RCC_CFGR_MCO2SEL_FIELD(6U)
#define RCC_CFGR_MCO2SEL_LSE                RCC_CFGR_MCO2SEL_FIELD(7U)
#define RCC_CFGR_MCO2SEL_HSIUSB48           RCC_CFGR_MCO2SEL_FIELD(8U)

