ChibiOS/ChibiOS/os/hal/ports/STM32/STM32C0xx/hal_lld.h
#define RCC_CFGR_MCO2PRE_FIELD(n)           ((n) << RCC_CFGR_MCO2PRE_Pos)
#define RCC_CFGR_MCO2PRE_DIV1               RCC_CFGR_MCO2PRE_FIELD(0U)
#define RCC_CFGR_MCO2PRE_DIV2               RCC_CFGR_MCO2PRE_FIELD(1U)
#define RCC_CFGR_MCO2PRE_DIV4               RCC_CFGR_MCO2PRE_FIELD(2U)
#define RCC_CFGR_MCO2PRE_DIV8               RCC_CFGR_MCO2PRE_FIELD(3U)
#define RCC_CFGR_MCO2PRE_DIV16              RCC_CFGR_MCO2PRE_FIELD(4U)
#define RCC_CFGR_MCO2PRE_DIV32              RCC_CFGR_MCO2PRE_FIELD(5U)
#define RCC_CFGR_MCO2PRE_DIV64              RCC_CFGR_MCO2PRE_FIELD(6U)
#define RCC_CFGR_MCO2PRE_DIV128             RCC_CFGR_MCO2PRE_FIELD(7U)
#if STM32_RCC_HAS_MCODIVEXT || defined(__DOXYGEN__)
#define RCC_CFGR_MCO2PRE_DIV256             RCC_CFGR_MCO2PRE_FIELD(8U)
#define RCC_CFGR_MCO2PRE_DIV512             RCC_CFGR_MCO2PRE_FIELD(9U)
#define RCC_CFGR_MCO2PRE_DIV1024            RCC_CFGR_MCO2PRE_FIELD(10U)
#endif

#define RCC_CFGR_MCOSEL_FIELD(n)            ((n) << RCC_CFGR_MCOSEL_Pos)
#define RCC_CFGR_MCOSEL_NOCLOCK             RCC_CFGR_MCOSEL_FIELD(0U)
#define RCC_CFGR_MCOSEL_SYSCLK              RCC_CFGR_MCOSEL_FIELD(1U)
#define RCC_CFGR_MCOSEL_HSI48               RCC_CFGR_MCOSEL_FIELD(3U)
#define RCC_CFGR_MCOSEL_HSE                 RCC_CFGR_MCOSEL_FIELD(4U)
#define RCC_CFGR_MCOSEL_LSI                 RCC_CFGR_MCOSEL_FIELD(6U)
#define RCC_CFGR_MCOSEL_LSE                 RCC_CFGR_MCOSEL_FIELD(7U)
#define RCC_CFGR_MCOSEL_HSIUSB48            RCC_CFGR_MCOSEL_FIELD(8U)

#define RCC_CFGR_MCOPRE_FIELD(n)            ((n) << RCC_CFGR_MCOPRE_Pos)
#define RCC_CFGR_MCOPRE_DIV1                RCC_CFGR_MCOPRE_FIELD(0U)
#define RCC_CFGR_MCOPRE_DIV2                RCC_CFGR_MCOPRE_FIELD(1U)
#define RCC_CFGR_MCOPRE_DIV4                RCC_CFGR_MCOPRE_FIELD(2U)
#define RCC_CFGR_MCOPRE_DIV8                RCC_CFGR_MCOPRE_FIELD(3U)
#define RCC_CFGR_MCOPRE_DIV16               RCC_CFGR_MCOPRE_FIELD(4U)
#define RCC_CFGR_MCOPRE_DIV32               RCC_CFGR_MCOPRE_FIELD(5U)
#define RCC_CFGR_MCOPRE_DIV64               RCC_CFGR_MCOPRE_FIELD(6U)
#define RCC_CFGR_MCOPRE_DIV128              RCC_CFGR_MCOPRE_FIELD(7U)
#if STM32_RCC_HAS_MCODIVEXT || defined(__DOXYGEN__)
#define RCC_CFGR_MCOPRE_DIV256              RCC_CFGR_MCOPRE_FIELD(8U)
#define RCC_CFGR_MCOPRE_DIV512              RCC_CFGR_MCOPRE_FIELD(9U)
#define RCC_CFGR_MCOPRE_DIV1024             RCC_CFGR_MCOPRE_FIELD(10U)
#endif
/** @} */

/**
 * @name    RCC_CCIPR register helpers
 * @{
 */
#define RCC_CCIPR_USART1SEL_FIELD(n)        ((n) << RCC_CCIPR_USART1SEL_Pos)
#define RCC_CCIPR_USART1SEL_PCLK            RCC_CCIPR_USART1SEL_FIELD(0U)
#define RCC_CCIPR_USART1SEL_SYSCLK          RCC_CCIPR_USART1SEL_FIELD(1U)
#define RCC_CCIPR_USART1SEL_HSIKER          RCC_CCIPR_USART1SEL_FIELD(2U)
#define RCC_CCIPR_USART1SEL_LSE             RCC_CCIPR_USART1SEL_FIELD(3U)

#if defined(RCC_CCIPR_FDCAN1SEL_Pos) || defined(__DOXYGEN__)
#define RCC_CCIPR_FDCAN1SEL_FIELD(n)        ((n) << RCC_CCIPR_FDCAN1SEL_Pos)
#else
#define RCC_CCIPR_FDCAN1SEL_FIELD(n)        0U
#endif
#define RCC_CCIPR_FDCAN1SEL_PCLK            RCC_CCIPR_FDCAN1SEL_FIELD(0U)
#define RCC_CCIPR_FDCAN1SEL_HSIKER          RCC_CCIPR_FDCAN1SEL_FIELD(1U)
#define RCC_CCIPR_FDCAN1SEL_HSE             RCC_CCIPR_FDCAN1SEL_FIELD(2U)

#define RCC_CCIPR_I2C1SEL_FIELD(n)          ((n) << RCC_CCIPR_I2C1SEL_Pos)
#define RCC_CCIPR_I2C1SEL_PCLK              RCC_CCIPR_I2C1SEL_FIELD(0U)
#define RCC_CCIPR_I2C1SEL_SYSCLK            RCC_CCIPR_I2C1SEL_FIELD(1U)
#define RCC_CCIPR_I2C1SEL_HSIKER            RCC_CCIPR_I2C1SEL_FIELD(2U)

#define RCC_CCIPR_I2S1SEL_FIELD(n)          ((n) << RCC_CCIPR_I2S1SEL_Pos)
#define RCC_CCIPR_I2S1SEL_SYSCLK            RCC_CCIPR_I2S1SEL_FIELD(0U)
#define RCC_CCIPR_I2S1SEL_HSIKER            RCC_CCIPR_I2S1SEL_FIELD(2U)
#define RCC_CCIPR_I2S1SEL_CKIN              RCC_CCIPR_I2S1SEL_FIELD(3U)

#define RCC_CCIPR_ADCSEL_FIELD(n)          ((n) << RCC_CCIPR_ADCSEL_Pos)
#define RCC_CCIPR_ADCSEL_SYSCLK             RCC_CCIPR_ADCSEL_FIELD(0U)
#define RCC_CCIPR_ADCSEL_HSIKER             RCC_CCIPR_ADCSEL_FIELD(2U)
/** @} */

/**
 * @name    RCC_CCIPR2 register helpers
 * @{
 */
#if defined(RCC_CCIPR2_USBSEL_Pos) || defined(__DOXYGEN__)
#define RCC_CCIPR2_USBSEL_FIELD(n)          ((n) << RCC_CCIPR2_USBSEL_Pos)
#else
#define RCC_CCIPR2_USBSEL_FIELD(n)          0U
#endif
#define RCC_CCIPR2_USBSEL_HSIUSB48          RCC_CCIPR2_USBSEL_FIELD(0U)
#define RCC_CCIPR2_USBSEL_HSE               RCC_CCIPR2_USBSEL_FIELD(1U)
/** @} */

/**
 * @name    RCC_CSR1 register helpers
 * @{
 */
#define RCC_CSR1_RTCSEL_FIELD(n)            ((n) << RCC_CSR1_RTCSEL_Pos)
#define RCC_CSR1_RTCSEL_NOCLOCK             RCC_CSR1_RTCSEL_FIELD(0U)
#define RCC_CSR1_RTCSEL_LSE                 RCC_CSR1_RTCSEL_FIELD(1U)
#define RCC_CSR1_RTCSEL_LSI                 RCC_CSR1_RTCSEL_FIELD(2U)
#define RCC_CSR1_RTCSEL_HSEDIV              RCC_CSR1_RTCSEL_FIELD(3U)

#define RCC_CSR1_LSCOSEL_FIELD(n)           ((n) << RCC_CSR1_LSCOSEL_Pos)
#define RCC_CSR1_LSCOSEL_NOCLOCK            RCC_CSR1_LSCOSEL_FIELD(0U)
#define RCC_CSR1_LSCOSEL_LSI                RCC_CSR1_LSCOSEL_FIELD(1U)
#define RCC_CSR1_LSCOSEL_LSE                RCC_CSR1_LSCOSEL_FIELD(3U)
/** @} */

/* ST headers inconsistencies...*/
#if !defined(FLASH_ACR_LATENCY_0WS)
#define FLASH_ACR_LATENCY_0WS   (0U << FLASH_ACR_LATENCY_Pos)
#endif
#if !defined(FLASH_ACR_LATENCY_1WS)
#define FLASH_ACR_LATENCY_1WS   (0U << FLASH_ACR_LATENCY_Pos)
#endif

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Disables the PWR/RCC initialization in the HAL.
 */
#if !defined(STM32_NO_INIT) || defined(__DOXYGEN__)
#define STM32_NO_INIT                       FALSE
#endif

/**
 * @brief   PWR CR2 register initialization value.
 */
#if !defined(STM32_PWR_CR2) || defined(__DOXYGEN__)
#define STM32_PWR_CR2                       (PWR_CR2_PVM_VDDIO2_ENABLED)
#endif

/**
 * @brief   PWR CR3 register initialization value.
 */
#if !defined(STM32_PWR_CR3) || defined(__DOXYGEN__)
#define STM32_PWR_CR3                       (PWR_CR3_EIWUL)
#endif

/**
 * @brief   PWR CR4 register initialization value.
 */
#if !defined(STM32_PWR_CR4) || defined(__DOXYGEN__)
#define STM32_PWR_CR4                       (0U)
#endif

/**
 * @brief   PWR PUCRA register initialization value.
 */
#if !defined(STM32_PWR_PUCRA) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRA                     (0U)
#endif

/**
 * @brief   PWR PDCRA register initialization value.
 */
#if !defined(STM32_PWR_PDCRA) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRA                     (0U)
#endif

/**
 * @brief   PWR PUCRB register initialization value.
 */
#if !defined(STM32_PWR_PUCRB) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRB                     (0U)
#endif

/**
 * @brief   PWR PDCRB register initialization value.
 */
#if !defined(STM32_PWR_PDCRB) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRB                     (0U)
#endif

/**
 * @brief   PWR PUCRC register initialization value.
 */
#if !defined(STM32_PWR_PUCRC) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRC                     (0U)
#endif

/**
 * @brief   PWR PDCRC register initialization value.
 */
#if !defined(STM32_PWR_PDCRC) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRC                     (0U)
#endif

/**
 * @brief   PWR PUCRD register initialization value.
 */
#if !defined(STM32_PWR_PUCRD) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRD                     (0U)
#endif

/**
 * @brief   PWR PDCRD register initialization value.
 */
#if !defined(STM32_PWR_PDCRD) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRD                     (0U)
#endif

/**
 * @brief   PWR PUCRF register initialization value.
 */
#if !defined(STM32_PWR_PUCRF) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRF                     (0U)
#endif

/**
 * @brief   PWR PDCRF register initialization value.
 */
#if !defined(STM32_PWR_PDCRF) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRF                     (0U)
#endif

/**
 * @brief   SYSCFG CFGR1 register initialization value.
 */
#if !defined(STM32_SYSCFG_CFGR1) || defined(__DOXYGEN__)
#define STM32_SYSCFG_CFGR1                  (0U)
#endif

/**
 * @brief   SYSCFG CFGR2 register initialization value.
 */
#if !defined(STM32_SYSCFG_CFGR2) || defined(__DOXYGEN__)
#define STM32_SYSCFG_CFGR2                  (0U)
#endif

/**
 * @brief   SYSCFG CFGR3 register initialization value.
 */
#if !defined(STM32_SYSCFG_CFGR3) || defined(__DOXYGEN__)
#define STM32_SYSCFG_CFGR3                  (0U)
#endif

/**
 * @brief   HSIDIV divider value.
 * @note    The allowed values are 1, 2, 4, 8, 16, 32, 64, 128.
 */
#if !defined(STM32_HSIDIV_VALUE) || defined(__DOXYGEN__)
#define STM32_HSIDIV_VALUE                  4
#endif

/**
 * @brief   HSIKER divider value.
 * @note    The allowed values are 1..8.
 */
#if !defined(STM32_HSIKERDIV_VALUE) || defined(__DOXYGEN__)
#define STM32_HSIKERDIV_VALUE               3
#endif

/**
 * @brief   Enables or disables the HSI48 clock source.
 */
#if !defined(STM32_HSI48_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSI48_ENABLED                 FALSE
#endif

/**
 * @brief   Enables or disables the HSIUSB48 clock source.
 */
#if !defined(STM32_HSIUSB48_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSIUSB48_ENABLED              FALSE
#endif

/**
 * @brief   Enables or disables the HSE clock source.
 */
#if !defined(STM32_HSE_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSE_ENABLED                   FALSE
#endif

/**
 * @brief   Enables or disables the LSI clock source.
 */
#if !defined(STM32_LSI_ENABLED) || defined(__DOXYGEN__)
#define STM32_LSI_ENABLED                   FALSE
#endif

/**
 * @brief   Enables or disables the LSE clock source.
 */
#if !defined(STM32_LSE_ENABLED) || defined(__DOXYGEN__)
#define STM32_LSE_ENABLED                   FALSE
#endif

/**
 * @brief   Main clock source selection.
 */
#if !defined(STM32_SW) || defined(__DOXYGEN__)
#define STM32_SW                            RCC_CFGR_SW_HSISYS
#endif

/**
 * @brief   SYSDIV divider value.
 * @note    The allowed values are 1..8.
 */
#if !defined(STM32_SYSDIV_VALUE) || defined(__DOXYGEN__)
#define STM32_SYSDIV_VALUE                  1
#endif

/**
 * @brief   AHB prescaler value.
 */
#if !defined(STM32_HPRE) || defined(__DOXYGEN__)
#define STM32_HPRE                          RCC_CFGR_HPRE_DIV1
#endif

/**
 * @brief   APB prescaler value.
 */
#if !defined(STM32_PPRE) || defined(__DOXYGEN__)
#define STM32_PPRE                          RCC_CFGR_PPRE_DIV1
#endif

/**
 * @brief   MCO clock source.
 */
#if !defined(STM32_MCOSEL) || defined(__DOXYGEN__)
#define STM32_MCOSEL                        RCC_CFGR_MCOSEL_NOCLOCK
#endif

/**
 * @brief   MCO divider setting.
 */
#if !defined(STM32_MCOPRE) || defined(__DOXYGEN__)
#define STM32_MCOPRE                        RCC_CFGR_MCOPRE_DIV1
#endif

/**
 * @brief   MCO2 clock source.
 */
#if !defined(STM32_MCO2SEL) || defined(__DOXYGEN__)
#define STM32_MCO2SEL                       RCC_CFGR_MCO2SEL_NOCLOCK
#endif

/**
 * @brief   MCO2 divider setting.
 */
#if !defined(STM32_MCO2PRE) || defined(__DOXYGEN__)
#define STM32_MCO2PRE                       RCC_CFGR_MCO2PRE_DIV1
#endif

/**
 * @brief   LSCO clock source.
 */
#if !defined(STM32_LSCOSEL) || defined(__DOXYGEN__)
#define STM32_LSCOSEL                       RCC_CSR1_LSCOSEL_NOCLOCK
#endif

/**
 * @brief   USART1 clock source.
 */
#if !defined(STM32_USART1SEL) || defined(__DOXYGEN__)
#define STM32_USART1SEL                     RCC_CCIPR_USART1SEL_SYSCLK
#endif

/**
 * @brief   FDCAN1 clock source.
 */
#if !defined(STM32_FDCAN1SEL) || defined(__DOXYGEN__)
#define STM32_FDCAN1SEL                     RCC_CCIPR_FDCAN1SEL_PCLK
#endif

/**
 * @brief   I2C1 clock source.
 */
#if !defined(STM32_I2C1SEL) || defined(__DOXYGEN__)
#define STM32_I2C1SEL                       RCC_CCIPR_I2C1SEL_PCLK
#endif

/**
 * @brief   I2S1 clock source.
 */
#if !defined(STM32_I2S1SEL) || defined(__DOXYGEN__)
#define STM32_I2S1SEL                       RCC_CCIPR_I2S1SEL_SYSCLK
#endif

/**
 * @brief   ADC clock source.
 */
#if !defined(STM32_ADCSEL) || defined(__DOXYGEN__)
#define STM32_ADCSEL                        RCC_CCIPR_ADCSEL_SYSCLK
#endif

/**
 * @brief   USB clock source.
 */
#if !defined(STM32_USBSEL) || defined(__DOXYGEN__)
#define STM32_USBSEL                        RCC_CCIPR2_USBSEL_HSIUSB48
#endif

/**
 * @brief   RTC clock source.
 */
#if !defined(STM32_RTCSEL) || defined(__DOXYGEN__)
#define STM32_RTCSEL                        RCC_CSR1_RTCSEL_NOCLOCK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

