ChibiOS/ChibiOS/os/hal/ports/STM32/STM32C0xx/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32C0xx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C0xx_MCUCONF not defined"
#endif

#if defined(STM32C011xx) && !defined(STM32C011_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C011_MCUCONF not defined"

#elif defined(STM32C031xx) && !defined(STM32C031_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C031_MCUCONF not defined"

#elif defined(STM32C051xx) && !defined(STM32C051_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C051_MCUCONF not defined"

#elif defined(STM32C071xx) && !defined(STM32C071_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C071_MCUCONF not defined"

#elif defined(STM32C091xx) && !defined(STM32C091_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C091_MCUCONF not defined"

#elif defined(STM32C092xx) && !defined(STM32C092_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C092_MCUCONF not defined"

#endif

/*
 * Board files sanity checks.
 */
#if !defined(STM32_LSECLK)
#error "STM32_LSECLK not defined in board.h"
#endif

#if !defined(STM32_LSEDRV)
#error "STM32_LSEDRV not defined in board.h"
#endif

#if !defined(STM32_HSECLK)
#error "STM32_HSECLK not defined in board.h"
#endif

/**
 * @name    System Limits
 * @{
 */
#define STM32_SYSCLK_MAX                    48000000
#define STM32_HSECLK_MAX                    48000000
#define STM32_HSECLK_BYP_MAX                48000000
#define STM32_HSECLK_MIN                    4000000
#define STM32_HSECLK_BYP_MIN                8000000
#define STM32_LSECLK_MAX                    32768
#define STM32_LSECLK_BYP_MAX                1000000
#define STM32_LSECLK_MIN                    32768
#define STM32_LSECLK_BYP_MIN                32768
#define STM32_PCLK_MAX                      48000000
#define STM32_ADCCLK_MAX                    350000000

#define STM32_0WS_THRESHOLD                 24000000
/** @} */

/* Clock handlers.*/
#include "stm32_lse_v3.inc"
#include "stm32_lsi_v3.inc"
#include "stm32_hsi48.inc"
#include "stm32_hsiusb48.inc"
#include "stm32_hse.inc"

/*
 * HSI48 related checks.
 */
#if STM32_RCC_HAS_HSI48
#if STM32_HSI48_ENABLED
#else /* !STM32_HSI48_ENABLED */

  #if STM32_SW == RCC_CFGR_SW_HSISYS
    #error "HSI48 not enabled, required by STM32_SW"
  #endif

  #if STM32_MCOSEL == RCC_CFGR_MCOSEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCO2SEL"
  #endif

  #if (STM32_ADCSEL == RCC_CCIPR_ADCSEL_HSIKER)
    #error "HSI48 not enabled, required by STM32_ADCSEL"
  #endif

  #if (STM32_I2C1SEL == RCC_CCIPR_I2C1SEL_HSIKER)
    #error "HSI48 not enabled, required by STM32_I2C1SEL"
  #endif

  #if (STM32_USART1SEL == RCC_CCIPR_USART1SEL_HSIKER)
    #error "HSI48 not enabled, required by STM32_USART1SEL"
  #endif

#endif /* !STM32_HSI48_ENABLED */
#endif /* STM32_RCC_HAS_HSI48 */

/*
 * HSIUSB48 related checks.
 */
#if STM32_RCC_HAS_HSIUSB48
#if STM32_HSIUSB48_ENABLED
#else /* !STM32_HSIUSB48_ENABLED */

  #if STM32_SW == RCC_CFGR_SW_HSIUSB48
    #error "HSIUSB48 not enabled, required by STM32_SW"
  #endif

  #if STM32_MCOSEL == RCC_CFGR_MCOSEL_HSIUSB48
    #error "HSIUSB48 not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSIUSB48
    #error "HSIUSB48 not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_USBSEL == RCC_CCIPR2_USBSEL_HSIUSB48
    #error "HSIUSB48 not enabled, required by STM32_USBSEL"
  #endif

#endif /* !STM32_HSIUSB48_ENABLED */
#endif /* STM32_RCC_HAS_HSI48 */

/*
 * HSE related checks.
 */
#if STM32_HSE_ENABLED

  #if STM32_HSECLK == 0
   #error "HSE oscillator not available on the board"
  #endif

#else /* !STM32_HSE_ENABLED */

  #if STM32_SW == RCC_CFGR_SW_HSE
    #error "HSE not enabled, required by STM32_SW"
  #endif

  #if STM32_MCOSEL == RCC_CFGR_MCOSEL_HSE
    #error "HSE not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSE
    #error "HSE not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_RTCSEL == RCC_CSR1_RTCSEL_HSEDIV
    #error "HSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_HAS_USB
    #if STM32_USBSEL == RCC_CCIPR2_USBSEL_HSE
      #error "HSE not enabled, required by STM32_USBSEL"
    #endif
  #endif

#endif /* !STM32_HSE_ENABLED */

/*
 * LSI related checks.
 */
#if STM32_LSI_ENABLED
#else /* !STM32_LSI_ENABLED */

  #if HAL_USE_RTC && (STM32_RTCSEL == RCC_CSR1_RTCSEL_LSI)
    #error "LSI not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == RCC_CFGR_MCOSEL_LSI
    #error "LSI not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == RCC_CFGR_MCO2SEL_LSI
    #error "LSI not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_LSCOSEL == RCC_CSR1_LSCOSEL_LSI
    #error "LSI not enabled, required by STM32_LSCOSEL"
  #endif

#endif /* !STM32_LSI_ENABLED */

/*
 * LSE related checks.
 */
#if STM32_LSE_ENABLED

  #if STM32_LSECLK == 0
   #error "LSE oscillator not available on the board"
  #endif

#else /* !STM32_LSE_ENABLED */

  #if STM32_RTCSEL == RCC_CSR1_RTCSEL_LSE
    #error "LSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == RCC_CFGR_MCOSEL_LSE
    #error "LSE not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == RCC_CFGR_MCO2SEL_LSE
    #error "LSE not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_LSCOSEL == RCC_CSR1_LSCOSEL_LSE
    #error "LSE not enabled, required by STM32_LSCOSEL"
  #endif

  #if (STM32_USART1SEL == RCC_CCIPR_USART1SEL_LSE)
    #error "LSE not enabled, required by STM32_USART1SEL"
  #endif

#endif /* !STM32_LSE_ENABLED */

/**
 * @brief   STM32_HSIDIV field.
 */
#if (STM32_HSIDIV_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_HSIDIV                      RCC_CR_HSIDIV_DIV1

#elif STM32_HSIDIV_VALUE == 2
  #define STM32_HSIDIV                      RCC_CR_HSIDIV_DIV2

#elif STM32_HSIDIV_VALUE == 4
  #define STM32_HSIDIV                      RCC_CR_HSIDIV_DIV4

#elif STM32_HSIDIV_VALUE == 8
  #define STM32_HSIDIV                      RCC_CR_HSIDIV_DIV8

#elif STM32_HSIDIV_VALUE == 16
  #define STM32_HSIDIV                      RCC_CR_HSIDIV_DIV16

#elif STM32_HSIDIV_VALUE == 32
  #define STM32_HSIDIV                      RCC_CR_HSIDIV_DIV32

#elif STM32_HSIDIV_VALUE == 64
  #define STM32_HSIDIV                      RCC_CR_HSIDIV_DIV64

#elif STM32_HSIDIV_VALUE == 128
  #define STM32_HSIDIV                      RCC_CR_HSIDIV_DIV128

#else
  #error "invalid STM32_HSIDIV_VALUE value specified"
#endif

/**
 * @brief   STM32_HSIKERDIV field.
 */
#if (STM32_HSIKERDIV_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_HSIKERDIV                   RCC_CR_HSIKERDIV_DIV1

#elif STM32_HSIKERDIV_VALUE == 2
  #define STM32_HSIKERDIV                   RCC_CR_HSIKERDIV_DIV2

#elif STM32_HSIKERDIV_VALUE == 3
  #define STM32_HSIKERDIV                   RCC_CR_HSIKERDIV_DIV3

#elif STM32_HSIKERDIV_VALUE == 4
  #define STM32_HSIKERDIV                   RCC_CR_HSIKERDIV_DIV4

