ChibiOS/ChibiOS/os/hal/ports/STM32/STM32C0xx/hal_lld.h
#elif STM32_USART1SEL == RCC_CCIPR_USART1SEL_HSIKER
  #define STM32_USART1CLK                   hal_lld_get_clock_point(CLK_HSIKERCLK)

#elif STM32_USART1SEL == RCC_CCIPR_USART1SEL_LSE
  #define STM32_USART1CLK                   STM32_LSECLK

#else
  #error "invalid source selected for USART1 clock"
#endif

/**
 * @brief   USART2 clock frequency.
 */
#define STM32_USART2CLK                     hal_lld_get_clock_point(CLK_PCLK)

/**
 * @brief   FDCAN1 clock frequency.
 */
#if (STM32_FDCAN1SEL == RCC_CCIPR_FDCAN1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_FDCAN1CLK                   hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_FDCAN1SEL == STM32_FDCAN1SELL_HSIKER
  #define STM32_FDCAN1CLK                   hal_lld_get_clock_point(CLK_HSIKERCLK)

#elif STM32_FDCAN1SEL == STM32_FDCAN1SELL_HSE
  #define STM32_FDCAN1CLK                   STM32_HSECLK

#else
  #error "invalid source selected for FDCAN1 clock"
#endif

/**
 * @brief   I2C1 clock frequency.
 */
#if (STM32_I2C1SEL == RCC_CCIPR_I2C1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_I2C1CLK                     hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_I2C1SEL == RCC_CCIPR_I2C1SEL_SYSCLK
  #define STM32_I2C1CLK                     hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_I2C1SEL == RCC_CCIPR_I2C1SEL_HSIKER
  #define STM32_I2C1CLK                     hal_lld_get_clock_point(CLK_HSIKERCLK)

#else
  #error "invalid source selected for I2C1 clock"
#endif

/**
 * @brief   I2C2 clock frequency.
 */
#define STM32_I2C2CLK                       hal_lld_get_clock_point(CLK_PCLK)

/**
 * @brief   I2S1 clock frequency.
 */
#if (STM32_I2S1SEL == RCC_CCIPR_I2S1SEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_I2S1CLK                     hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_I2S1SEL == RCC_CCIPR_I2S1SEL_PLLPCLK
  #define STM32_I2S1CLK                     hal_lld_get_clock_point(CLK_PLLPCLK)

#elif STM32_I2S1SEL == RCC_CCIPR_I2S1SEL_HSIKER
  #define STM32_I2S1CLK                     hal_lld_get_clock_point(CLK_HSIKERCLK)

#elif STM32_I2S1SEL == RCC_CCIPR_I2S1SEL_CKIN
  #define STM32_I2S1CLK                     0 /* Unknown, would require a board value */

#else
#error "invalid source selected for I2S1 clock"
#endif

/**
 * @brief   ADC clock frequency.
 */
#if (STM32_ADCSEL == RCC_CCIPR_ADCSEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_ADCCLK                      hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_ADCSEL == RCC_CCIPR_ADCSEL_HSIKER
  #define STM32_ADCCLK                      hal_lld_get_clock_point(CLK_HSIKERCLK)

#else
  #error "invalid source selected for ADC clock"
#endif

/**
 * @brief   USB clock frequency.
 */
#if (STM32_USBSEL == RCC_CCIPR2_USBSEL_HSIUSB48) || defined(__DOXYGEN__)
  #define STM32_USBCLK                      hal_lld_get_clock_point(CLK_HSIUSB48CLK)

#elif STM32_USBSEL == RCC_CCIPR2_USBSEL_HSE
  #define STM32_USBCLK                      STM32_HSECLK

#else
  #error "invalid source selected for USB clock"
#endif

/**
 * @brief   TIMPCLK clock frequency.
 */
#if (STM32_PPRE == STM32_PPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_TIMPCLK                     (STM32_PCLK * 1)

#else
  #define STM32_TIMPCLK                     (STM32_PCLK * 2)
#endif

/**
 * @brief   Clock of timers connected to APB1.
 */
#define STM32_TIMCLK1                       hal_lld_get_clock_point(CLK_PCLKTIM)

/**
 * @brief   Clock of timers connected to APB2.
 */
#define STM32_TIMCLK2                       hal_lld_get_clock_point(CLK_PCLKTIM)

/**
 * @brief   Flash settings.
 */
#if (STM32_HCLK <= STM32_0WS_THRESHOLD) || defined(__DOXYGEN__)
  #define STM32_FLASHBITS                   0

#else
  #define STM32_FLASHBITS                   FLASH_ACR_LATENCY_0
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of a clock point identifier.
 */
typedef unsigned halclkpt_t;

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_SYSCLK        ? STM32_SYSCLK      :                       \
   (clkpt) == CLK_HSE           ? STM32_HSECLK      :                       \
   (clkpt) == CLK_HSISYS        ? STM32_HSISYSCLK   :                       \
   (clkpt) == CLK_HSIKER        ? STM32_HSIKERCLK   :                       \
   (clkpt) == CLK_HSIUSB48      ? STM32_HSIUSB48CLK :                       \
   (clkpt) == CLK_HCLK          ? STM32_HCLK        :                       \
   (clkpt) == CLK_PCLK          ? STM32_PCLK        :                       \
   (clkpt) == CLK_PCLKTIM       ? STM32_TIMPCLK     :                       \
   (clkpt) == CLK_MCO1          ? STM32_MCOCLK      :                       \
   (clkpt) == CLK_MCO2          ? STM32_MCO2CLK     :                       \
   0U)

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
#include "stm32_isr.h"
#include "stm32_dma.h"
#include "stm32_exti.h"
#include "stm32_rcc.h"
#include "stm32_tim.h"

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void stm32_clock_init(void);
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
